Classes | Public Member Functions | Static Public Member Functions | List of all members
ACAPI::MEP::PipingPort Class Referencefinal
MEP Element Manager
The PipingPort represents a connection point of a pipe segment. More...
#include <MEPPipingPort.hpp>
 Inheritance diagram for ACAPI::MEP::PipingPort:
 Classes
class  | Modifier
Modifier of the PipingPort. More...
 Public Member Functions
double  | GetOuterDiameter () const
double  | GetWallThickness () const
FlowDirection  | GetFlowDirection () const
template<typename ModifierFunc >
Result< void >  | Modify (const ModifierFunc &modifierFunc, const GS::UniString &undoString)
Executes the passed modifier scope in an Undoable command.
 Public Member Functions inherited from ACAPI::MEP::PortBase
bool  | Exists () const
GS::UniString  | GetName () const
Orientation  | GetOrientation () const
double  | GetWidth () const
double  | GetHeight () const
ConnectorShape  | GetShape () const
API_Coord3D  | GetPosition () const
Domain  | GetDomain () const
API_AttributeIndex  | GetMEPSystem () const
std::optional< UniqueID >  | GetConnectedPortId () const
std::optional< UniqueID >  | GetConnectedMEPElementId () const
UniqueID  | GetMEPElementId () const
bool  | IsPhysicallyConnected () const
Result< bool >  | IsPhysicallyConnectable (const UniqueID &portId) const
template<typename ModifierFunc >
Result< void >  | Modify (const ModifierFunc &modifierFunc, const GS::UniString &undoString)
Executes the passed modifier scope in an Undoable command.
 Public Member Functions inherited from ACAPI::Object
Object (std::shared_ptr< Impl::ObjectImpl > impl)
Constructs a new object.
const API_Token &  | GetToken () const
Get the token for this object.
 Static Public Member Functions
static Result< PipingPort >  | Get (const UniqueID &uniqueId)
Returns a PipingPort.
 Additional Inherited Members
 Protected Member Functions inherited from ACAPI::MEP::PortBase
PortBase (std::shared_ptr< Impl::IPortBaseImpl > impl)
Constructs a PortBase with the given port base implementation.
 Protected Member Functions inherited from ACAPI::Object
~Object ()
Default destructor.
 Protected Attributes inherited from ACAPI::Object
 std::shared_ptr< Impl::ObjectImpl >  | mImpl
Impl object given by constructor.
Detailed Description
The PipingPort represents a connection point of a pipe segment.
Since
Archicad 27
Example code snippet from Test / New MEP
Take a look at PortBase
Member Function Documentation
◆ Get()
 static Result< PipingPort > ACAPI::MEP::PipingPort::Get  |  ( |  const UniqueID & |  uniqueId | )
static
Returns a PipingPort.
Parameters
uniqueId | The UniqueID of the requested PipingPort.
Returns
If the uniqueId belongs to a PipingPort, returns the object associated to it, otherwise Error.
◆ GetFlowDirection()
 FlowDirection ACAPI::MEP::PipingPort::GetFlowDirection  |  ( |   | ) |   const
Returns
Returns the flow direction of the PipingPort.
◆ GetOuterDiameter()
 double ACAPI::MEP::PipingPort::GetOuterDiameter  |  ( |   | ) |   const
Returns
Returns the outer diameter of the PipingPort.
◆ GetWallThickness()
 double ACAPI::MEP::PipingPort::GetWallThickness  |  ( |   | ) |   const
Returns
Returns the wall thickness of the PipingPort.
◆ Modify()
 template<typename ModifierFunc >
 Result< void > ACAPI::MEP::PipingPort::Modify  |  ( |  const ModifierFunc & |  modifierFunc,
|  const GS::UniString & |  undoString )
Executes the passed modifier scope in an Undoable command.
Parameters
modifierFunc | The modifier scope (lambda, std::function or function pointer) the caller wants to execute.
undoString | The text which appears in the undo queue of Archicad after executing the command.
Returns
Returns an error if the process of modification fails for some reason, otherwise nothing.